## Examples I

In [1]:
# Examples I
import numpy as np
import pandas as pd
from env import get_db_url

url = get_db_url('employees')

In [2]:
pd.read_sql('SELECT * FROM employees', url)

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [3]:
pd.read_sql('SELECT * FROM employees', url)

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [24]:
employees = pd.read_sql('SELECT * FROM employees', url)

In [25]:
titles = pd.read_sql('SELECT * FROM titles', url)

In [6]:
type(employees)

pandas.core.frame.DataFrame

In [7]:
type(titles)

pandas.core.frame.DataFrame

In [8]:
employees

   emp_no  birth_date first_name    last_name gender   hire_date
0   10051  1953-07-28   Hidefumi        Caine      M  1992-10-15
1   10052  1961-02-26     Heping       Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv     Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi    Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy       Dredge      M  1992-04-27
5   10056  1961-09-01    Brendon      Bernini      F  1990-02-01
6   10057  1954-05-30       Ebbe     Callaway      F  1992-01-15
7   10058  1954-10-01    Berhard     McFarlin      M  1987-04-13
8   10059  1953-09-19  Alejandro     McAlpine      F  1991-06-26
9   10060  1961-10-15   Breannda  Billingsley      M  1987-11-02

In [9]:
employees.shape

(10, 6)

In [10]:
titles

   emp_no            title   from_date     to_date
0   10036     Senior Staff  1992-04-28  9999-01-01
1   10037         Engineer  1990-12-05  1995-12-05
2   10037  Senior Engineer  1995-12-05  9999-01-01
3   10038     Senior Staff  1996-09-20  9999-01-01
4   10038            Staff  1989-09-20  1996-09-20
5   10039     Senior Staff  1997-01-18  9999-01-01
6   10039            Staff  1988-01-19  1997-01-18
7   10040         Engineer  1993-02-14  1999-02-14
8   10040  Senior Engineer  1999-02-14  9999-01-01
9   10041     Senior Staff  1998-11-12  9999-01-01

In [11]:
titles.shape

(10, 4)

In [12]:
#8
employees.describe()

            emp_no
count     10.00000
mean   10055.50000
std        3.02765
min    10051.00000
25%    10053.25000
50%    10055.50000
75%    10057.75000
max    10060.00000

In [13]:
titles.describe()

             emp_no
count     10.000000
mean   10038.500000
std        1.581139
min    10036.000000
25%    10037.250000
50%    10038.500000
75%    10039.750000
max    10041.000000

In [14]:
#9
sql = '''
SELECT DISTINCT title FROM titles;
'''
unique_titles = pd.read_sql(sql, url)
unique_titles

                title
0     Senior Engineer
1               Staff
2            Engineer
3        Senior Staff
4  Assistant Engineer
5    Technique Leader
6             Manager

In [15]:
titles.nunique()

emp_no        6
title         4
from_date    10
to_date       5
dtype: int64

In [16]:
#10
titles.groupby('to_date').min()

            emp_no            title   from_date
to_date
1995-12-05   10037         Engineer  1990-12-05
1996-09-20   10038            Staff  1989-09-20
1997-01-18   10039            Staff  1988-01-19
1999-02-14   10040         Engineer  1993-02-14
9999-01-01   10036  Senior Engineer  1992-04-28

In [17]:
titles.to_date.agg('min')

datetime.date(1995, 12, 5)

In [18]:
titles.to_date.sort_values().head(1)

1    1995-12-05
Name: to_date, dtype: object

In [19]:
#11
pd.read_sql('SELECT max(to_date) FROM titles LIMIT 1 WHERE NOT to_date LIKE '9999%', get_db_url)

SyntaxError: invalid syntax (3844967898.py, line 2)

In [ ]:
titles.to_date.agg('max')

In [ ]:
titles.groupby('to_date').max()

In [ ]:
pd.concat([employees, titles], axis=1)

## Examples II

In [49]:

#1a Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})

#1b Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})

In [ ]:
users

In [ ]:
roles

In [36]:
#2 Using right join
pd.merge(users,roles, on='id', how= 'right', indicator = True)

   id name_x  role_id     name_y _merge
0   1    bob      1.0      admin   both
1   2    joe      2.0     author   both
2   3  sally      3.0   reviewer   both
3   4   adam      3.0  commenter   both

In [48]:
#3 Using outer join
pd.merge(users,roles, left_on='role_id', right_on='id', how= 'outer',indicator = True)
#Nans included

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

In [ ]:
users.keys()

In [ ]:
roles.keys()

In [39]:
#4 Drop foreign keys and try to merge
users_drop = users.drop(columns='role_id')
users_drop

   id   name
0   1    bob
1   2    joe
2   3  sally
3   4   adam
4   5   jane
5   6   mike

In [40]:
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [50]:
pd.merge(users_drop, roles, on='id')

   id name_x     name_y
0   1    bob      admin
1   2    joe     author
2   3  sally   reviewer
3   4   adam  commenter

In [51]:
#4 Drop foreign keys and try to merge
pd.merge(users,roles, on='id', how= 'outer').drop('id',axis=1)
#Mixed up info.

  name_x  role_id     name_y
0    bob      1.0      admin
1    joe      2.0     author
2  sally      3.0   reviewer
3   adam      3.0  commenter
4   jane      NaN        NaN
5   mike      NaN        NaN

In [69]:
#5 Import mpg dataset
from pydataset import data

In [68]:
#6 Output and read mpg
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [54]:
#7 How many rows and colums
mpg.shape

(234, 11)

In [81]:
#8 Check column names and clean up if needed
#mpg.columns
#mpg.columns.tolist()
mpg = mpg.rename(columns={'displ':'displacement', 'cyl':'cylinders', 'trans':'transmission', 'drv':'drive','cty':'city','hwy':'highway','fl':'fuel'})
mpg.head()

,manufacturer,model,displacement,year,cylinders,transmission,drive,city,highway,fuel,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact

In [82]:
#9 Display summary stats
mpg.describe(exclude=np.number)

       manufacturer        model transmission drive fuel class
count           234          234          234   234  234   234
unique           15           38           10     3    5     7
top           dodge  caravan 2wd     auto(l4)     f    r   suv
freq             37           11           83   106  168    62

In [83]:
#10
mpg['manufacturer'].nunique()

15

In [84]:
mpg.manufacturer.nunique()

15

In [85]:
#11
mpg['model'].nunique()

38

In [75]:
mpg.model.nunique()

38

In [86]:
#12
mpg['mileage_difference'] = (mpg.highway - mpg.city)
mpg

,manufacturer,model,displacement,year,cylinders,transmission,drive,city,highway,fuel,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

In [87]:
#13
mpg['average_mileage'] = mpg[['city','highway']].mean(axis=1)
mpg

,manufacturer,model,displacement,year,cylinders,transmission,drive,city,highway,fuel,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

In [88]:
mpg.assign(mileage_difference= mpg.highway-mpg.city,
          average_mileage = (mpg.city + mpg.highway)/2)

,manufacturer,model,displacement,year,cylinders,transmission,drive,city,highway,fuel,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

In [89]:
#14
mpg['is_automatic'] = mpg.transmission.str.startswith('auto')
mpg

,manufacturer,model,displacement,year,cylinders,transmission,drive,city,highway,fuel,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

In [90]:
mpg.describe(exclude=np.number)

       manufacturer        model transmission drive fuel class is_automatic
count           234          234          234   234  234   234          234
unique           15           38           10     3    5     7            2
top           dodge  caravan 2wd     auto(l4)     f    r   suv         True
freq             37           11           83   106  168    62          157

In [91]:
#15
best_mpg = mpg.groupby('manufacturer').average_mileage.mean().nlargest(1, keep= 'all')
best_mpg

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

In [92]:
mpg.groupby('manufacturer').average_mileage.mean().sort_values(ascending=False).round(2)

manufacturer
honda         28.50
volkswagen    25.07
hyundai       22.75
subaru        22.43
audi          22.03
toyota        21.72
pontiac       21.70
nissan        21.35
chevrolet     18.45
ford          16.68
mercury       15.62
jeep          15.56
dodge         15.54
lincoln       14.17
land rover    14.00
Name: average_mileage, dtype: float64

In [ ]:
#16
who_has_best_mpg = np.where(mpg.groupby('is_automatic').average_mileage.mean().nlargest(1,keep='all'), 'Manuals have better mpg', 'Autos have better mpg')
who_has_best_mpg

In [94]:
# Boolean
mpg.groupby('is_automatic')[['city', 'highway']].mean().sort_values(by= 'highway', ascending =False)

                   city    highway
is_automatic
False         18.675325  25.779221
True          15.968153  22.292994

In [97]:
# Use np.where
mpg['transmission_category'] = np.where(mpg.transmission.str.startswith('a'), 'auto', 'manual')
mpg.head()

,manufacturer,model,displacement,year,cylinders,transmission,drive,city,highway,fuel,class,mileage_difference,average_mileage,is_automatic,transmission_category
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True,auto
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False,manual
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False,manual
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True,auto
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True,auto

In [100]:
#Average of transmissions' mileage
mpg.groupby('transmission_category')[['city', 'highway']].mean()

                            city    highway
transmission_category
auto                   15.968153  22.292994
manual                 18.675325  25.779221

## Examples III

In [109]:
#1
chipotle_url = get_db_url('chipotle')
chipotle = chipotle_url

In [110]:
chipotle = pd.read_sql('SELECT * FROM orders;', chipotle_url)

In [111]:
chipotle.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

In [113]:
chipotle.shape

(4622, 6)

In [117]:
chipotle.describe()

                id     order_id     quantity
count  4622.000000  4622.000000  4622.000000
mean   2311.500000   927.254868     1.075725
std    1334.400802   528.890796     0.410186
min       1.000000     1.000000     1.000000
25%    1156.250000   477.250000     1.000000
50%    2311.500000   926.000000     1.000000
75%    3466.750000  1393.000000     1.000000
max    4622.000000  1834.000000    15.000000

In [104]:
#2 Change str to float, replace '$', and add up orders' amounts
chipotle['total_bill'] = chipotle.item_price.str.replace('$','',regex = False).astype(float)

chipotle.groupby('order_id').total_bill.agg('sum')

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: total_bill, Length: 1834, dtype: float64

In [105]:
#3 Most popular 3 items
chipotle.groupby('item_name').quantity.agg('sum').nlargest(n=3, keep= 'all')

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

In [106]:
#4 Item producing most revenue
# Need to have total price per line.
chipotle['total_item_price'] = chipotle.quantity * chipotle.item_price

chipotle.groupby('item_name').total_bill.sum().nlargest(n=1, keep= 'all')

item_name
Chicken Bowl    7342.73
Name: total_bill, dtype: float64

In [23]:
titles

   emp_no            title   from_date     to_date
0   10036     Senior Staff  1992-04-28  9999-01-01
1   10037         Engineer  1990-12-05  1995-12-05
2   10037  Senior Engineer  1995-12-05  9999-01-01
3   10038     Senior Staff  1996-09-20  9999-01-01
4   10038            Staff  1989-09-20  1996-09-20
5   10039     Senior Staff  1997-01-18  9999-01-01
6   10039            Staff  1988-01-19  1997-01-18
7   10040         Engineer  1993-02-14  1999-02-14
8   10040  Senior Engineer  1999-02-14  9999-01-01
9   10041     Senior Staff  1998-11-12  9999-01-01

In [118]:
#5 Join 'employees' and 'titles' DFs,
emp_titles = employees.merge(titles, on='emp_no')
emp_titles.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01

In [108]:
#6 Hire date for most recent hire.
emp_titles.groupby('title').hire_date.max()

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

In [31]:
#7 Cross tab - # titles per dept

dept_title_query ='''
                    SELECT t.emp_no
                    t.title
                    t.from_date
                    t.'''
pd.crosstab(emp_titles.title, emp_titles.)

AttributeError: 'DataFrame' object has no attribute 'dept'